//========================================================================
//! @file       Main.cpp
//{=======================================================================
//!
//! @brief      <Заголовок>\n
//! @brief      <Подзаголовок>
//!
//! @version    [Version 0.01 alpha, build 1]
//! @author     Copyright (C) <Автор>, <Год> (<Имя> <Почта>)
//! @date       <Дата>
//!
//! @par        Протестировано
//!           - (TODO: список платформ)
//!
//! @todo     - (TODO: список ближайших планов по этому файлу)
//!
//! @bug      - (TODO: список найденных ошибок в этом файле)
//!
//! @par        История изменений файла
//!           - Версия 0.01 Alpha
//!             - Только что созданный файл
//!
//}=======================================================================

#include "TXLib.h"

int main()
    {
    txCreateWindow (1100, 650);

    txRectangle(0, 0, 1100, 650);
    txSetColor (TX_BLACK);
    txSetFillColor (TX_BLACK);

    for (int y = 0; y < 1000; y = y + 30)
    {
        txLine   (0, y, 1100, y);
    }

    for (int x = 0; x < 1100; x = x + 30)
    {
        txLine   (x, 0, x, 650);
    }




    return 0;
    }

